app/controllers/admin/base_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 135138680 LIMIT 1
---
    def current_admin
      @current_admin ||= begin
        payload = JsonWebToken.decode(cookies.encrypted[:admin_token])
        User.find_by(id: payload[:sub]) if payload.present?