app/controllers/admin/images_controller.rb

    def create
      uploaded_image = params.require(:image)

      unless uploaded_image.content_type.in?(ALLOWED_IMAGE_TYPES)
        return render json: { error: "Unsupported image type." }, status: :unprocessable_entity
      end

      if uploaded_image.size > MAX_IMAGE_SIZE
        return render json: { error: "Image must be smaller than 5 MB." }, status: :unprocessable_entity
      end

      blob = ActiveStorage::Blob.create_and_upload!(
        io: uploaded_image.open,
        filename: uploaded_image.original_filename,
        content_type: uploaded_image.content_type
      )
---
INSERT INTO "active_storage_blobs" ("byte_size", "checksum", "content_type", "created_at", "filename", "key", "metadata", "service_name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"