app/controllers/admin/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
    def index
      @posts = Post.includes(:user).order(created_at: :desc)

INSERT INTO "posts" ("user_id", "title", "slug", "excerpt", "body_markdown", "status", "published_at", "created_at", "updated_at", "title_en", "excerpt_en", "body_markdown_en", "translation_status") VALUES (135138680, 'Meu Título do Artigo', 'meu-titulo-do-artigo', 'Este é o parágrafo de introdução que se torna o resumo.', '# Meu Título do Artigo
---
    def create
      @post = current_admin.posts.build(post_params)

      if @post.save

UPDATE "posts" SET "status" = 1, "published_at" = '2026-05-30 18:34:00', "updated_at" = '2026-05-30 22:34:54.596913' WHERE "posts"."id" = 675045404
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT $1  [["LIMIT", 1]]
---
    def update
      if @post.update(post_params)
        @post.cover_image.purge_later if remove_cover_image? && params.dig(:post, :cover_image).blank?

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'welcome' LIMIT 1
---
    def set_post
      @post = Post.find_by!(slug: params[:id])