app/controllers/admin/sessions_controller.rb

    def create
      user = User.find_by(email: params[:email].to_s.strip.downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'admin@example.com' LIMIT 1

    def current_admin
      payload = JsonWebToken.decode(cookies.encrypted[:admin_token])
      User.find_by(id: payload[:sub]) if payload.present?
---
SELECT "users".* FROM "users" WHERE "users"."id" = 135138680 LIMIT 1