app/views/admin/posts/_form.html.erb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT $1  [["LIMIT", 1]]
---
      <%= form.label :status, class: "block text-sm font-medium text-neutral-700 dark:text-neutral-300" %>
      <%= form.select :status,
                      Post.statuses.keys.map { |s| [ s.titleize, s ] },
                      {},
                      class: "mt-2 w-full rounded-md border border-neutral-300 bg-white px-3 py-2 text-neutral-950 shadow-sm focus:border-blue-600 focus:outline-none dark:border-neutral-700 dark:bg-neutral-900 dark:text-neutral-50" %>