app/views/admin/posts/show.html.erb

  <h2 class="text-sm font-medium uppercase tracking-[0.18em] text-neutral-500 dark:text-neutral-400">
    Comments (<%= @post.comments.size %>)
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 675045404