app/views/posts/_post.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3, $4, $5, $6)  [["post_id", 675045400], ["post_id", 675045401], ["post_id", 675045402], ["post_id", 675045403], ["post_id", 675045404], ["post_id", 675045405]]
SELECT "reactions".* FROM "reactions" WHERE "reactions"."post_id" IN ($1, $2, $3, $4, $5, $6)  [["post_id", 675045400], ["post_id", 675045401], ["post_id", 675045402], ["post_id", 675045403], ["post_id", 675045404], ["post_id", 675045405]]
---

  <% reaction_count = post.reactions.size; comment_count = post.comments.size %>