app/views/posts/_reactions.html.erb

  <%# The visitor's single current reaction (by account when signed in, else by durable cookie). %>
  <% mine = reader_signed_in? ? post.reactions.find { |r| r.reader_id == current_reader.id } :
---
SELECT "reactions".* FROM "reactions" WHERE "reactions"."post_id" = $1  [["post_id", 675045400]]