app/controllers/posts_controller.rb

  def index
    @page = [ params.fetch(:page, 1).to_i, 1 ].max
    posts = Post.visible.includes(:user, :reactions, :comments)

    @total_pages = (posts.count.to_f / POSTS_PER_PAGE).ceil
    @posts = posts.limit(POSTS_PER_PAGE).offset((@page - 1) * POSTS_PER_PAGE)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN (675045406, 675045405, 675045404, 675045402)
SELECT "reactions".* FROM "reactions" WHERE "reactions"."post_id" IN (675045406, 675045405, 675045404, 675045402)
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 675045402
SELECT "reactions".* FROM "reactions" WHERE "reactions"."post_id" = 675045402

  def show
    @post = Post.visible
                .includes(:user, :reactions, :comments)
                .find_by!(slug: params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3, $4, $5, $6)  [["post_id", 675045400], ["post_id", 675045401], ["post_id", 675045402], ["post_id", 675045403], ["post_id", 675045404], ["post_id", 675045405]]
SELECT "reactions".* FROM "reactions" WHERE "reactions"."post_id" IN ($1, $2, $3, $4, $5, $6)  [["post_id", 675045400], ["post_id", 675045401], ["post_id", 675045402], ["post_id", 675045403], ["post_id", 675045404], ["post_id", 675045405]]