app/controllers/reactions_controller.rb

SELECT "reactions".* FROM "reactions" WHERE "reactions"."post_id" = 675045402 AND "reactions"."session_id" = '5fe9a34b-bf56-4266-9393-ac9ad3370840' AND "reactions"."reaction_type" = 0 LIMIT 1
INSERT INTO "reactions" ("post_id", "reaction_type", "session_id", "created_at") VALUES (675045402, 0, '5fe9a34b-bf56-4266-9393-ac9ad3370840', '2026-05-30 20:03:45.143899') RETURNING "id"
---
  def create
    type = params[:reaction_type]
    return head :bad_request unless Reaction.reaction_types.key?(type)

    reaction = @post.reactions.find_by(session_id: session[:reader_id], reaction_type: type)

    if reaction
      reaction.destroy
    else
      @post.reactions.create!(session_id: session[:reader_id], reaction_type: type)